# HW_Java_Exception
### hw1_2 
Реализуйте метод divArrays, принимающий в качестве аргументов два целочисленных массива
a и b, и возвращающий новый массив с, каждый элемент которого равен частному элементов двух
входящих массивов в той же ячейке.
        Если длины массивов не равны - верните нулевой массив длины 1.
        Важно: При выполнении метода единственное исключение, которое пользователь может
        увидеть - RuntimeException, т.е. ваше.
        Напишите свой код в методе divArrays класса Answer.
        Метод divArrays принимает на вход два параметра:

        int[] a - первый массив
        int[] b - второй массив

        Пример

a = new int[]{12, 8, 16};
b = new int[]{4, 2, 4};

Вывод: [3, 4, 4]

a = new int[]{12, 8, 16, 25};
b = new int[]{4, 2, 4};

Вывод: [0]
### hw1_3 
Реализуйте метод subArrays, принимающий в качестве аргументов два целочисленных массива
 a и b, и возвращающий новый массив c, каждый элемент которого равен разности элементов
 двух входящих массивов в той же ячейке.
Если длины массивов не равны - верните нулевой массив длины 1.
Напишите свой код в методе subArrays класса Answer. Метод subArrays принимает на вход
два параметра:

int[] a - первый массив
int[] b - второй массив

Пример

a = new int[]{4, 5, 6};
b = new int[]{1, 2, 3};

Вывод: [3, 3, 3]

a = new int[]{4, 5, 6};
b = new int[]{1, 2, 3, 5};

Вывод: [0]
### hw2_1
Реализуйте метод, который запрашивает у пользователя ввод дробного числа (типа float),
и возвращает введенное значение. Ввод текста вместо числа не должно приводить к
падению приложения, вместо этого, необходимо повторно запросить у пользователя ввод данных.
### hw2_2
Если необходимо, исправьте данный код

try {
   int d = 0;
   double catchedRes1 = intArray[8] / d;
   System.out.println("catchedRes1 = " + catchedRes1);
} catch (ArithmeticException e) {
   System.out.println("Catching exception: " + e);
}
### hw2_3
Дан следующий код, исправьте его там, где требуется
### hw2_4
Разработайте программу, которая выбросит Exception, когда пользователь вводит пустую строку.
 Пользователю должно показаться сообщение, что пустые строки вводить нельзя.
 ### hw21
 Напишите программу, которая запрашивает у пользователя число и проверяет,
является ли оно положительным. Если число отрицательное или равно нулю,
программа должна выбрасывать исключение InvalidNumberException с сообщением
"Некорректное число". В противном случае программа должна выводить сообщение
"Число корректно".
### hw22
Напишите программу, которая запрашивает у пользователя два числа и выполняет их деление.
Если второе число равно нулю, программа должна выбрасывать исключение DivisionByZeroException с сообщением
"Деление на ноль недопустимо". В противном случае программа должна выводить результат деления.

Обратите внимание, что в обеих задачах используются собственные исключения, которые наследуются от класса Exception.
Это позволяет нам определить специфическую причину ошибки и передать информацию об ошибке для последующей обработки.
### hw23
Напишите программу, которая запрашивает у пользователя три числа и выполняет следующие проверки:

Если первое число больше 100, выбросить исключение NumberOutOfRangeException с сообщением
"Первое число вне допустимого диапазона".

Если второе число меньше 0, выбросить исключение NumberOutOfRangeException с сообщением
"Второе число вне допустимого диапазона".

Если сумма первого и второго чисел меньше 10, выбросить исключение NumberSumException с сообщением
"Сумма первого и второго чисел слишком мала".

Если третье число равно 0, выбросить исключение DivisionByZeroException с сообщением "Деление на ноль недопустимо".
В противном случае программа должна выводить сообщение "Проверка пройдена успешно".
- необходимо создать 3 класса собвстенных исключений
### hw3_1
Задача 1: Проверка пароля (Основы языка Java, операторы, ветвления)

Создайте класс PasswordVerifier. Этот класс должен содержать метод, который принимает строку пароля и проверяет его 
на соответствие следующим правилам:

Пароль должен быть не менее 8 символов.
Пароль должен содержать хотя бы одну цифру.
Пароль должен содержать хотя бы одну заглавную букву.
Метод должен выбрасывать исключение, если пароль не соответствует какому-либо из этих правил.
### hw3_2
Задача 2: Файловый менеджер (ООП, исключения)

Создайте класс FileManager. Этот класс должен иметь методы для выполнения основных операций с файлами: чтение, 
запись и копирование. Каждый из этих методов должен выбрасывать соответствующее исключение, если в процессе выполнения 
операции произошла ошибка (например, FileNotFoundException, если файл не найден).
